[{"level": "Avanzado", "sc_hour": "16", "sc_track": "Avanzado", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/7/", "title": "Objetos básicos en CPython", "abstract": "Recorrido por los tipos de datos y objetos Builtin de CPython, y una breve descripción de como están implementados.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/4/"]}, {"level": "Científico", "sc_hour": "16", "sc_track": "Científico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/13/", "title": "Automatización de simulaciones para procesos de optimización", "abstract": "En las etapas de diseño Ingenieril, y más específicamente en el diseño de determinados artefactos navales, puede ser necesario llevar a cabo un gran número de simulaciones CFD para analizar y mejorar el comportamiento de los mismos, lo que implica un elevado coste computacional y humano. Se pretende analizar y discutir el uso de Python con el objetivo de reducir significativamente dichos costes.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/20/"]}, {"level": "Básico", "sc_hour": "16", "sc_track": "Básico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/2/", "title": "Pilas engine", "abstract": "Pilas Engine permite crear juegos de forma didáctica y divertida. Está dirigido a personas que comienzan a programar videojuegos y quieren lograr resultados sorprendentes y divertidos en poco tiempo.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/2/"]}, {"level": "Avanzado", "sc_hour": "12:30", "sc_track": "Científico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/36/", "title": "Mobility data storage and analysis", "abstract": "En el marco del proyecto EUNOIA se están recolectando datos relacionados con movilidad. El objectivo es estudiar patrones de movimento en áreas urbanas. Por ejemplo el estilo de vida o la actitud de cada persona puede mostrarnos distintos comportamientos, que son particularmente importantes para desarrollar formas de gestión para influir en las decisiones relacionadas con movilidad.\r\nEn este contexto usamos tweets geolocalizados como fuente de información para hallar patrones de movilidad. Mediante el uso de Python logramos bajar, guardar y analizar eficientemente una gran cantidad de datos.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/24/"]}, {"level": "Avanzado", "sc_hour": "16", "sc_track": "Avanzado", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/37/", "title": "Hy: una Lista Interminable y Superflua de Paréntesis en Python", "abstract": "Hy es una variante de Lisp con ideas de Clojure y Common Lisp pero con las baterías incluidas de Python. La charla comenzará por una introducción al lenguaje para posteriormente mostrar como genera dinámicamente el AST de Python haciendo de Hy un lisp plenamente compatible con éste. Es el Lisp perfecto para aprender más sobre el funcionamiento de Python y la forma más cómoda de aprender Lisp si ya conoces Python.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/26/"]}, {"level": "Avanzado", "sc_hour": "12:30", "sc_track": "Avanzado", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/30/", "title": "SonSilentSea, creación de juegos en Blender con Python", "abstract": "Tras dos años de desarrollo de un juego de simulación naval usando C++ con OGRE, SonSilentSea da un giro de timón con el objetivo de simplificar y acelerar el desarrollo, optando por el motor de Blender (Blender Game Engine). El objetivo es comparar el desarrollo de este tipo de aplicaciones en ambos entornos, y aprovechar para hacer una introducción de lo simple que resulta desarrollar un juego en Python con la ayuda de Blender.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/7/"]}, {"level": "Avanzado", "sc_hour": "10", "sc_track": "Avanzado", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/24/", "title": "Metaprogramación con Python 3", "abstract": "Una pequeña introducción a las grandes profundidades de qué es y cómo se construye una clase en Python con ejemplos prácticos de cómo aprovechar el \"poder intrometerse\" en distintas partes del proceso de creación de la misma. Se tocarán temas como: clases+metaclases, properties, descriptores, compilación de código dinámicamente generado y import hooks.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/5/"]}, {"level": "Básico", "sc_hour": "17:30", "sc_track": "Básico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/34/", "title": "Django Best Practices", "abstract": "Django es un framework web Python de alto nivel que fomenta el desarrollo rápido y el diseño limpio y pragmático. La charla consistirá en varias propuestas de \"best practices\" respecto al desarrollo y despliegue de projectos Django, así como en el uso de las apps externas más importantes.\r\nSi bien la charla está orientada a desarrolladores Django, no es imprescindible tener experiencia previa.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/22/"]}, {"level": "Básico", "sc_hour": "17:30", "sc_track": "Básico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/53/", "title": "Cuarenta características de Python que quizás no conoces", "abstract": "Esta charla presenta cuarenta aspectos interesantes de Python que con los años he ido descubriendo que mucha gente, incluso programadores veteranos, no conoce — detalles como la mejor forma de intercambiar variables u ordenar una lista, el operador ternario, relanzamiento de excepciones, joyas ocultas en módulos como collections o functools, o por qué 0.1 + 0.2 == 0.3 es False. La mayoría son muy prácticos y otros curiosidades de escasa o nula utilidad en el día a día, pero todos son conceptos sencillos de entender y que merece la pena tener presente.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/37/"]}, {"level": "Avanzado", "sc_hour": "17:30", "sc_track": "Avanzado", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/76/", "title": "Tulip or not Tulip", "abstract": "En Python 3.4 llegará una nueva librería llamada Tulip, ideada por el propio Guido, que traerá una manera unificada para desarrollar programas concurrentes en los que el manejo de \"threads\" se hace desde un propio eventloop dentro de Python.\r\n\r\nEn esta charla veremos librerías existentes antes de Tulip cómo gevent y analizaremos que aporta Tulip o los nuevos futuros al ecosistema actual.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/52/"]}, {"level": "Científico", "sc_hour": "16", "sc_track": "Científico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/72/", "title": "Programación Paralela y Distribuida: Cores, Threads y Nodes", "abstract": "Introduciremos que es esto de la Programación Paralela y distribuida, e iremos profundizando poco a poco, viendo como con el multiprocesamiento y con los sistemas distribuidos(Clusters, Grids...) podemos conseguir reducir el tiempo computacional de nuestros problemas y algoritmos. Veremos algunos ejemplos de problemas computacionalmente complejos e introduciremos algunas librerías de Python para llevar a cabo todo esto.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/50/"]}, {"level": "Avanzado", "sc_hour": "17:30", "sc_track": "Avanzado", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/64/", "title": "Generators Showdown Showcase", "abstract": "What are generators and coroutines in Python? What additional conceptualisations do they offer, and how can we use them to better model problems?\r\n\r\nThis is a talk I've given at PyCon Canada, PyData Boston, and PyTexas. It's an intermediate-level talk around the core concept of generators with a lot of examples of not only neat things you can do with generators but also new ways to model and conceptualise problems.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/46/"]}, {"level": "Básico", "sc_hour": "18:30", "sc_track": "Básico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/10/", "title": "50 Shades of Big Data", "abstract": "Big Data no es una moda, ¡es una estrategia! Es un workshop de 2 horas introductorio y abierto a todos los niveles. El objetivo del workshop es darte una base para que puedas enfrentarte a los retos que se esconden detrás del Big Data.\r\n\r\nTodo proyecto de Big Data tiene tres partes:\r\n\r\n1. Recolección de datos, que nosotros haremos usando técnicas de scraping.\r\n\r\n2. Tratamiento de los datos, donde veremos las diferencias entre tratar con archivos o usar una base de datos NoSQL.\r\n\r\n3. Mostrar resultados. Gracias a la librería D3, mostrar resultados nunca fue tan sencillo... o sexy!\r\n\r\n\r\nLos asistentes tendrán que llevar su propio ordenador.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/6/", "http://2013.es.pycon.org/api/v1/speakers/44/"]}, {"level": "Científico", "sc_hour": "9", "sc_track": "Científico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/39/", "title": "Python + Ciencia = <3", "abstract": "Python como lenguaje mola mucho más que MATLAB y no digo ya FORTRAN 77. Python engancha, sobre todo si te dedicas a la ciencia y la ingeniería: vamos a dar un breve repaso a las posibilidades que ofrece en este campo, y por qué seguirá creciendo en los próximos años.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/28/"]}, {"level": "Científico", "sc_hour": "11:30", "sc_track": "Científico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/25/", "title": "Servicios lingüísticos en Python basado en reglas", "abstract": "Actualmente los métodos estadísticos son predominantes en tecnología del lenguaje;\r\nsin embargo un enfoque complementario basado en gramáticas ofrece resultados más precisos.\r\nRecientemente se ha desarrollado una interface Python para uno de los principales sistemas basados en este paradigma (GF). Mostraremos cómo se desarrolla un ejemplo de interface multilingüe con un sistema de álgebra por computador.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/16/"]}, {"level": "Científico", "sc_hour": "12:30", "sc_track": "Científico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/75/", "title": "Red-Light HAL", "abstract": "La visión artificial o Computer Vision (CV) es un campo apasionante con cantidad de oportunidades para la innovación. En esta charla:\r\n- Introduciremos SimpleCV, un increíble framework software libre para desarrollar aplicaciones de CV en Python.\r\n- Aprenderemos algunos conceptos sobre CV desde una perspectiva de alto nivel, demostrando que CV no es solo para mentes privilegiadas.\r\n- Experimentaremos combinando SimpleCV, Machine Learning y una Raspberry Pi para desarrollar una cámara inteligente de semáforo en rojo, con la que podremos resolver que coches son los que más se saltan el semáforo.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/51/"]}, {"level": "Básico", "sc_hour": "15", "sc_track": "Básico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/16/", "title": "Web Scraping con Python+Django", "abstract": "El objetivo de la charla es el análisis, mediante ejemplos prácticos, de técnicas de Scrapping y desarrollo de crawlers mediante Python y cómo usar Django para presentar la información recopilada.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/8/"]}, {"level": "Básico", "sc_hour": "10", "sc_track": "Básico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/40/", "title": "Empaquetar es fácil, si sabes cómo", "abstract": "Empaquetar una biblioteca en Python puede ser un proceso confuso lleno de incertidumbres y propenso a tomar decisiones equivocadas, pero va mejorando. En esta charla vamos a diferenciar claramente lo que está obsoleto de lo que no, explicando el presente y mirando al futuro.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/28/"]}, {"level": "Científico", "sc_hour": "15", "sc_track": "Científico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/63/", "title": "Mi primer Numba", "abstract": "Qué es Numba, por qué es diferente a otras alternativas y por qué deberías usarlo. Tutorial básico: modelado de problemas simples, optimización con Numba y análisis desde la perspectiva de un usuario no-iniciado.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/45/"]}, {"level": "Básico", "sc_hour": "9", "sc_track": "Básico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/73/", "title": "Python, the good parts", "abstract": "Muchos son los que conocen el zen de Python. Estos principios de diseño se centran en el cómo hacer las cosas, pero solamente el tiempo nos lleva a encontrar qué hacer para ser fieles a ellos. En esta charla se introducirán algunas de las prácticas más comunes adoptadas por la comunidad para producir código comúnmente referido como pythónico. Cómo utilizar programación funcional adecuadamente, patrones elegantes como decoradores, comprehensions, Python idiomático... Haremos un recorrido por algunas librerías de Python que pueden marcar la diferencia en nuestros proyectos y analizaremos algunas de las APIs de Python más humanas, explicando su filosofía y la de la comunidad. Veremos cómo los PEPs son la herramienta que ha permitido a Python llegar a ser lo que es a día de hoy.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/51/"]}, {"level": "Básico", "sc_hour": "12:30", "sc_track": "Básico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/58/", "title": "Desarrollo de aplicaciones Android con Python", "abstract": "En la charla trataremos la implementación de Python en sistemas Android y aprenderemos a construir   aplicaciones Python usando la api de Android, tocaremos las posibilidades posibles para la habilitación de un entorno de desarrollo cómodo y por último aprenderemos a distribuir nuestras aplicaciones para Android convirtiendo nuestros scripts en aplicaciones .apk", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/42/"]}, {"level": "Avanzado", "sc_hour": "15", "sc_track": "Avanzado", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/38/", "title": "La historia de todo lo que pudo salir mal... pero salió bien", "abstract": "La historia de cómo con más corazón que cabeza decidimos reescribir streetlife.com. Desde el diseño y la planificación hasta la implementación trataré de resumir los errores y aciertos que cometimos durante los tres meses de desarrollo, así como mostrar el resultado final que sirve hoy en día de punto de encuentro a más de 100k usuarios y que envía varios millones de emails al mes.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/27/"]}, {"level": "Avanzado", "sc_hour": "11:30", "sc_track": "Avanzado", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/28/", "title": "Decoradores desmitificados", "abstract": "¿Sabes lo que pasa cada vez que utilizas el símbolo @ en Python? En esta charla vamos a descubrir la magia que hay detrás del syntactic sugar de los decoradores. Para entender cómo funcionan internamente veremos en detalle los scopes y los namespaces de Python y luego aplicaremos manualmente nuestros propios decoradores.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/19/"]}, {"level": "Científico", "sc_hour": "17:30", "sc_track": "Científico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/43/", "title": "Yatel - Data Mining sobre redes", "abstract": "Se presenta una aplicación desarrollada en Python (Yatel) que permite crear redes basadas en distancias entre perfiles de individuos y analizarlas multidimensionalmente mediante un proceso de exploración.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/30/"]}, {"level": "Avanzado", "sc_hour": "12:30", "sc_track": "Avanzado", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/4/", "title": "Haciendo código que analiza código con AST", "abstract": "La charla se centra en mostrar cómo escribir aplicaciones utilizando el modulo AST (Abstract Syntax Trees) de Python, el cual permite analizar código Python e ir explorandolo y hacer programas que \"entiendan\" el código producido por un programador para crear distinto tipos de herramientas como  chequeadores estáticos de código, herramientas de autocompletado, etc.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/3/"]}, {"level": "Avanzado", "sc_hour": "9", "sc_track": "Avanzado", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/18/", "title": "PEP-3156: IO Asyncrona en Python. ¿Cómo funciona un event loop?", "abstract": "Una de las mayores ventajas de Python es su filosofía de \"batteries included\", pero desafortunadamente no hay una solución al i/o asíncrono universal. PEP-3156 promete ser la solución a este problema, pero ¿en qué consiste? ¿cómo funciona? Ven a averiguarlo.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/10/"]}, {"level": "Científico", "sc_hour": "10", "sc_track": "Científico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/59/", "title": "Procesamiento de patrones en Python", "abstract": "El tratamiento de señales digitales (textos, sonido y voz, imágenes) es un extenso y fecundo campo para el estudio teórico y experimental de una gran variedad de algoritmos, como por ejemplo los que aparecen en los problemas de compresión y descompresión de datos e imágenes o en la síntesis y análisis de patrones (generalmente con componentes que dependen de parámetros estocásticos). Para tales fines, la potencia, expresividad y robustez de python lo convierten en un lenguaje de programación ideal, tanto para investigadores como para clases de laboratorio de asignaturas cuyos contenidos tengan relación con estas temáticas. El objetivo de la charla es presentar algunos de los algoritmos más relevantes utilizados en teoría de la señal e ilustrarlos con implementaciones en un entorno basado en Python.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/43/"]}, {"level": "Científico", "sc_hour": "9", "sc_track": "Científico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/49/", "title": "El uso de Python en la ingeniería química.", "abstract": "La resolución de ecuaciones diferenciales parciales (EDPs) mediante métodos numéricos permite obtener soluciones a problemas típicos presentes en diferentes fenómenos físicos como la propagación del sonido o del calor, la electrostática, la electrodinámica, la dinámica de fluidos, la elasticidad, etc. Por otro lado, los programas de modelado algebraico permiten la resolución de diferentes problemas que van desde la selección óptima de equipos y recursos en sector industrial químico, a la gestión logística de una empresa genérica. Con el objetivo de mostrar el potencial actual de Python y sus librerías, se introducirán y resolverán algunos ejemplos prácticos de los problemas arriba descritos.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/66/", "http://2013.es.pycon.org/api/v1/speakers/34/", "http://2013.es.pycon.org/api/v1/speakers/58/", "http://2013.es.pycon.org/api/v1/speakers/59/", "http://2013.es.pycon.org/api/v1/speakers/60/"]}, {"level": "Básico", "sc_hour": "10", "sc_track": "Básico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/83/", "title": "Produban (Charla patrocinada)", "abstract": "", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/64/"]}, {"level": "Básico", "sc_hour": "11:30", "sc_track": "Básico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/69/", "title": "El mejor Framework POO/SOLID (Python OO SOLID)", "abstract": "En esta charla pretendemos transmitir nuestra experiencia orientando el desarrollo en el dominio del problema, usando simplemente Python, diseño OO siguiendo los principios SOLID, arquitectura desacoplada de los delivery mechanisms (http, cli, colas mensajes), y de las herramientas/tecnologías usadas para desarrollar el sistema (BDs, Indexadores, clientes REST, MOMs, etc.).  No dejes que tu Framework te use.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/61/", "http://2013.es.pycon.org/api/v1/speakers/63/", "http://2013.es.pycon.org/api/v1/speakers/62/", "http://2013.es.pycon.org/api/v1/speakers/49/"]}, {"level": "Básico", "sc_hour": "16", "sc_track": "Básico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/32/", "title": "El desconocido módulo Collections", "abstract": "Todo el mundo conoce los tipos básicos de Python y sus contenedores más comunes (list, tuple, dict y set). En cambio, poca gente sabe que para implementar una cola debería utilizar un deque, que con un defaultdict su código quedaría más limpio y sería un poco más eficiente o que podría utilizar namedtuples en lugar de crear nuevas clases. En esta charla repasaremos las estructuras del módulo collections de la librería estándar: namedtuple, deque, Counter, OrderedDict y defaultdict. Veremos su funcionalidad, particularidades y casos prácticos de uso.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/19/"]}, {"level": "Científico", "sc_hour": "10", "sc_track": "Científico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/84/", "title": "BityVip (Charla patrocinada)", "abstract": "", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/65/"]}, {"level": "Básico", "sc_hour": "11:30", "sc_track": "Básico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/71/", "title": "S.O.L.I.D Python", "abstract": "SOLID (Single responsibility, Open-closed, Liskov substitution, Interface segregation and Dependency inversion): cinco principios básicos de la programación y diseño orientado a objetos. Conocer estos principios, saber sus motivaciones, ventajas e inconvenientes, es básico para conseguir aplicaciones Python con un buen diseño OO, fáciles de mantener y evolucionar. Aprende S.O.L.I.D. mediante ejemplos Python.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/61/", "http://2013.es.pycon.org/api/v1/speakers/63/", "http://2013.es.pycon.org/api/v1/speakers/62/", "http://2013.es.pycon.org/api/v1/speakers/49/"]}, {"level": "Avanzado", "sc_hour": "15", "sc_track": "Avanzado", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/42/", "title": "Pensando en APIs", "abstract": "Un programador suele diseñar un módulo que generaliza un problema, y por otro lado se deja el uso de este software a programadores con menos conocimiento sobre la funcionalidad brindada. Así es tarea del primero no solo diseñar una solución a este problema crítico, sino también exponer la funcionalidades necesarias, flexibles, simples y lo \"mas fáciles\" de entender. Durante la charla se va a explicar como dirigir el desarrollo para facilitar el cumplimiento de estos objetivos disminuyendo la cantidad de bugs y las inconsistencia de apis.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/30/"]}, {"level": "Básico", "sc_hour": "9", "sc_track": "Básico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/5/", "title": "Introducción a PyQT", "abstract": "PyQt es un binding del framework Qt para el lenguaje de Programación Python, el cual permite diseñar interfaces gráficas de usuario con un increíble potencial y una gran simplicidad. Esta librería no sólo\r\nconsta de recursos para el diseño de interfaces, sino que provee una gran cantidad de funcionalidades multiplataforma que pueden aprovecharse para el desarrollo de diversos programas. La charla\r\ncubrirá PyQt desde un enfoque básico mostrando las  características de dicho framework, para terminar con algunos ejemplos demostrando el potencial que posee la misma.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/3/"]}, {"level": "Básico", "sc_hour": "15", "sc_track": "Básico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/23/", "title": "TDD en Python", "abstract": "El objetivo de esta charla es realizar una introducción breve a TDD, en la que hablaremos de qué herramienta existen en Python con las que podemos escribir pruebas y aplicar TDD y, a continuación, mostrar cómo aplicar TDD en Python con ejemplos de algunas de las dudas y fallos más habituales a la hora de empezar con TDD y cómo solucionarlos. Dada la extensión de las charla (50 minutos), se dividiría en dos partes. La charla tiene un nivel introductorio.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/15/"]}, {"level": "Científico", "sc_hour": "17:30", "sc_track": "Científico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/31/", "title": "Presentando Sage, software matemático basado en Python", "abstract": "Conoce Sage, un programa de software que integra una enorme cantidad de software libre matemático y científico usando el lenguaje python. Sage se instala como servidor web para poder acceder desde el\r\nnavegador, y se usa cada vez más en entornos universitarios, para docencia e investigación.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/21/"]}, {"level": "Avanzado", "sc_hour": "10", "sc_track": "Avanzado", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/85/", "title": "SLOT DISPONIBLE PARA PATROCINADOR", "abstract": "", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/67/"]}, {"level": "Básico", "sc_hour": "12:30", "sc_track": "Básico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/80/", "title": "Brython (o cómo aprender javascript sin querer)", "abstract": "En esta charla vamos a hablar sobre Brython, un proyecto en el que se pretende llevar a Python al lado del cliente en la web. La charla se dividirá en los siguientes puntos:\r\na) ¿Qué es Brython?\r\nb) Las tripas de Brython\r\nc) ¿Cómo se consigue que funcione este engrendro en el navegador?\r\nd) ¿Cómo podría usar Brython? Uso de Brython\r\ne) Ejemplos de Brython en funcionamiento\r\nf) ¿Por qué funciona o no funciona en producción?\r\ng) Preguntas", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/55/"]}, {"level": "Avanzado", "sc_hour": "11:30", "sc_track": "Avanzado", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/65/", "title": "Embeddings of Python", "abstract": "How can Python be embedded into other applications (C/C++)? What bearing does this have on our conceptualisation of systems written in Python? This talk covers the very-high-level embedding and the\r\npure-embedding and also includes two novel embeddings: a zero-interpreter embedding using Cython and a Python interpreter embedded as a extension model within another Python interpreter (the \"Xzibit\" embedding.)\r\n\r\nThis is a talk I've given at PyData Boston and PyTexas. It's an advanced level talk around the ways we can embed Python into other (C/C++) applications. It includes two fairly novel results of my own research.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/46/"]}, {"level": "Científico", "sc_hour": "15", "sc_track": "Científico", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/62/", "title": "Pandas bowling: convierte tus datos en información", "abstract": "Introducción a la manipulación de datos utilizando pandas contra un set de datos públicos. Data munging: filtering, merging, grouping, estadísticas comunes e introducción al plotting.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/45/"]}, {"level": "Científico", "sc_hour": "11:30", "sc_track": "Científico", "sc_day": "Domingo", "url": "http://2013.es.pycon.org/api/v1/talks/67/", "title": "CloudSim: robots en la nube, el caso del DARPA Robotics Challenge", "abstract": "Con la popularización de los servicios de la nube, se abren nuevas oportunidades para muchos ámbitos, incluido el mundo de la robótica. El DARPA Robotics Challenge (http://www.theroboticschallenge.org/) es una competición a nivel mundial organizada por DARPA para producir robots que ayuden en desastres, tanto naturales como provocados. En la primera fase de la competición, los equipos participantes simularon sus algoritmos usando la nube y el software de licencia libre CloudSim, escrito en Python y desarrollado por la Open Source Robotics Foundation.\r\n\r\nEn esta charla hablaré de los requisitos que tenía que cumplir CloudSim, los retos a la hora de desarrollarlo e implantarlo, y cómo puede ayudar a cualquier organización que necesite simular\r\nexperimentos robóticos. ", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/47/"]}, {"level": "Avanzado", "sc_hour": "9", "sc_track": "Avanzado", "sc_day": "Sábado", "url": "http://2013.es.pycon.org/api/v1/talks/51/", "title": "Python hasta en los rincones", "abstract": "Cada vez podemos encontrar Python en los proyectos más insospechados. En esta charla veremos como hemos sido capaces de desarrollar un generador automático de código.  A partir de un fichero XML, que representa un informe médico, se genera una aplicación Android. \r\n\r\nY todo esto gracias fundamentalmente a la potencia de la librería estándar aderezado con alguna herramienta externa.", "speakers": ["http://2013.es.pycon.org/api/v1/speakers/25/"]}]